In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.random.randn(5,4))
df.columns = ["A", "B", "C", "D"]

In [3]:
df

          A         B         C         D
0 -0.561702 -0.862364  0.135242 -0.902538
1  0.771897  0.265861 -1.790326 -1.594909
2  0.790243  1.384696  0.892217 -1.070645
3 -0.920221 -0.940535 -0.299818 -0.482993
4  0.003738 -1.042548  0.405343 -1.220589

In [4]:
df.index = pd.date_range('20180214', periods=5)

In [5]:
df

                   A         B         C         D
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538
2018-02-15  0.771897  0.265861 -1.790326 -1.594909
2018-02-16  0.790243  1.384696  0.892217 -1.070645
2018-02-17 -0.920221 -0.940535 -0.299818 -0.482993
2018-02-18  0.003738 -1.042548  0.405343 -1.220589

In [6]:
df['E'] = [10, np.nan, 9.9, 10, np.nan]

In [7]:
df

                   A         B         C         D     E
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538  10.0
2018-02-15  0.771897  0.265861 -1.790326 -1.594909   NaN
2018-02-16  0.790243  1.384696  0.892217 -1.070645   9.9
2018-02-17 -0.920221 -0.940535 -0.299818 -0.482993  10.0
2018-02-18  0.003738 -1.042548  0.405343 -1.220589   NaN

In [9]:
df.dropna(how="any")

                   A         B         C         D     E
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538  10.0
2018-02-16  0.790243  1.384696  0.892217 -1.070645   9.9
2018-02-17 -0.920221 -0.940535 -0.299818 -0.482993  10.0

In [10]:
df.dropna(how="all")

                   A         B         C         D     E
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538  10.0
2018-02-15  0.771897  0.265861 -1.790326 -1.594909   NaN
2018-02-16  0.790243  1.384696  0.892217 -1.070645   9.9
2018-02-17 -0.920221 -0.940535 -0.299818 -0.482993  10.0
2018-02-18  0.003738 -1.042548  0.405343 -1.220589   NaN

In [11]:
df

                   A         B         C         D     E
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538  10.0
2018-02-15  0.771897  0.265861 -1.790326 -1.594909   NaN
2018-02-16  0.790243  1.384696  0.892217 -1.070645   9.9
2018-02-17 -0.920221 -0.940535 -0.299818 -0.482993  10.0
2018-02-18  0.003738 -1.042548  0.405343 -1.220589   NaN

In [12]:
df.fillna(value=9.8)

                   A         B         C         D     E
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538  10.0
2018-02-15  0.771897  0.265861 -1.790326 -1.594909   9.8
2018-02-16  0.790243  1.384696  0.892217 -1.070645   9.9
2018-02-17 -0.920221 -0.940535 -0.299818 -0.482993  10.0
2018-02-18  0.003738 -1.042548  0.405343 -1.220589   9.8

In [13]:
df

                   A         B         C         D     E
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538  10.0
2018-02-15  0.771897  0.265861 -1.790326 -1.594909   NaN
2018-02-16  0.790243  1.384696  0.892217 -1.070645   9.9
2018-02-17 -0.920221 -0.940535 -0.299818 -0.482993  10.0
2018-02-18  0.003738 -1.042548  0.405343 -1.220589   NaN

In [14]:
df.fillna(value=9.8, inplace=True)

In [15]:
df

                   A         B         C         D     E
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538  10.0
2018-02-15  0.771897  0.265861 -1.790326 -1.594909   9.8
2018-02-16  0.790243  1.384696  0.892217 -1.070645   9.9
2018-02-17 -0.920221 -0.940535 -0.299818 -0.482993  10.0
2018-02-18  0.003738 -1.042548  0.405343 -1.220589   9.8

In [16]:
df.isnull()

                A      B      C      D      E
2018-02-14  False  False  False  False  False
2018-02-15  False  False  False  False  False
2018-02-16  False  False  False  False  False
2018-02-17  False  False  False  False  False
2018-02-18  False  False  False  False  False

In [17]:
pd.to_datetime("20180214")

Timestamp('2018-02-14 00:00:00')

In [18]:
df.drop?

In [19]:
df

                   A         B         C         D     E
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538  10.0
2018-02-15  0.771897  0.265861 -1.790326 -1.594909   9.8
2018-02-16  0.790243  1.384696  0.892217 -1.070645   9.9
2018-02-17 -0.920221 -0.940535 -0.299818 -0.482993  10.0
2018-02-18  0.003738 -1.042548  0.405343 -1.220589   9.8

In [20]:
df.drop(pd.to_datetime('20180215'))

                   A         B         C         D     E
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538  10.0
2018-02-16  0.790243  1.384696  0.892217 -1.070645   9.9
2018-02-17 -0.920221 -0.940535 -0.299818 -0.482993  10.0
2018-02-18  0.003738 -1.042548  0.405343 -1.220589   9.8

In [21]:
df

                   A         B         C         D     E
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538  10.0
2018-02-15  0.771897  0.265861 -1.790326 -1.594909   9.8
2018-02-16  0.790243  1.384696  0.892217 -1.070645   9.9
2018-02-17 -0.920221 -0.940535 -0.299818 -0.482993  10.0
2018-02-18  0.003738 -1.042548  0.405343 -1.220589   9.8

In [22]:
df.drop( [pd.to_datetime("20180215"), pd.to_datetime("20180217")] )

                   A         B         C         D     E
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538  10.0
2018-02-16  0.790243  1.384696  0.892217 -1.070645   9.9
2018-02-18  0.003738 -1.042548  0.405343 -1.220589   9.8

In [25]:
#에러
#df.drop(pd.to_datetime("20180215"): pd.to_datetime("20180217"))

In [26]:
df.drop("E", axis=1)

                   A         B         C         D
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538
2018-02-15  0.771897  0.265861 -1.790326 -1.594909
2018-02-16  0.790243  1.384696  0.892217 -1.070645
2018-02-17 -0.920221 -0.940535 -0.299818 -0.482993
2018-02-18  0.003738 -1.042548  0.405343 -1.220589

In [29]:
#df.drop([1:3], axis=1)

In [30]:
#df.drop(df.iloc[1:3])

In [31]:
df.drop(df.index[2])

                   A         B         C         D     E
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538  10.0
2018-02-15  0.771897  0.265861 -1.790326 -1.594909   9.8
2018-02-17 -0.920221 -0.940535 -0.299818 -0.482993  10.0
2018-02-18  0.003738 -1.042548  0.405343 -1.220589   9.8

In [32]:
df.drop(df.index[[2,3]])

                   A         B         C         D     E
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538  10.0
2018-02-15  0.771897  0.265861 -1.790326 -1.594909   9.8
2018-02-18  0.003738 -1.042548  0.405343 -1.220589   9.8

In [33]:
df.drop(df.index[1:3])

                   A         B         C         D     E
2018-02-14 -0.561702 -0.862364  0.135242 -0.902538  10.0
2018-02-17 -0.920221 -0.940535 -0.299818 -0.482993  10.0
2018-02-18  0.003738 -1.042548  0.405343 -1.220589   9.8

In [41]:
# df.drop(df.index[1:3], axis=1)

In [34]:
df.drop(["B","D"], axis=1)

                   A         C     E
2018-02-14 -0.561702  0.135242  10.0
2018-02-15  0.771897 -1.790326   9.8
2018-02-16  0.790243  0.892217   9.9
2018-02-17 -0.920221 -0.299818  10.0
2018-02-18  0.003738  0.405343   9.8

In [35]:
df2 = pd.DataFrame(np.arange(12).reshape(3,4),
                  columns=['A','B','C','D'])

In [37]:
df2

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [38]:
df2.drop(['B','C'], axis=1)

   A   D
0  0   3
1  4   7
2  8  11

In [39]:
df2.drop([0,1])

   A  B   C   D
2  8  9  10  11